number = int (input())
bonus = 0

# •	Ако числото е до 100 включително, бонус точките са 5;
# •	Ако числото е по-голямо от 100 и по-малко или равно на 1000, бонус точките са 20% от числото;
# •	Ако числото е по-голямо от 1000, бонус точките са 10% от числото.
if number <= 100:
    bonus = 5
elif number <= 1000:
    bonus = number * 0.20
elif number > 1000:
    bonus = number * 0.10

    # •	Допълнителни бонус точки (начисляват се отделно от предходните):
    # o	За четно число  + 1 т.
    # o	За число, което завършва на 5  + 2 т.
if number % 2 == 0:
    bonus = bonus + 1
elif number % 10 == 5:
    bonus = bonus + 2

print (bonus)
print (bonus + number)
