# Ресторант отваря врати и предлага няколко менюта на преференциални цени:
# •	Пилешко меню –  10.35 лв.
# •	Меню с риба – 12.40 лв.
# •	Вегетарианско меню  – 8.15 лв.
chicken_price = 10.35
fish_price = 12.40
vegeterian_price = 8.15

# Напишете програма, която изчислява колко ще струва на група хора да си поръчат храна за вкъщи.
# Групата ще си поръча и десерт, чиято цена е равна на 20% от общата сметка (без доставката).
# Цената на доставка е 2.50 лв и се начислява най-накрая.
# Вход
# От конзолата се четат 3 реда:
# •	Брой пилешки менюта – цяло число в интервала [0 … 99]
# •	Брой менюта с риба – цяло число в интервала [0 … 99]
# •	Брой вегетариански менюта – цяло число в интервала [0 … 99]
chicken_number = int (input())
fish_number = int (input())
vegeterian_number = int (input())

food_price = (chicken_price * chicken_number) + (fish_price * fish_number) + (vegeterian_number * vegeterian_price)
dessert_price = food_price * 0.20
food_total = food_price + dessert_price + 2.50

# Изход
# Да се отпечата на конзолата един ред:  "{цена на поръчката}"
print (float (food_total))
